ЛИС2/src/Documents/АттестатАккредитации/АттестатАккредитации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АттестатАккредитации</name>
  <registerRecords>InformationRegister.лис_ПриложениеКАттестатуАккредитации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАттестата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдавшийДокумент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВнесенияВРеестр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Приложение</name>
    <attributes>
      <name>РазделУчета</name>
      <type>
        <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрязняющееВещество</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Методика</name>
      <type>
        <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/InformationRegisters/лис_ПриложениеКАттестатуАккредитации/лис_ПриложениеКАттестатуАккредитации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>лис_ПриложениеКАттестатуАккредитации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДиапазонОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиапазонДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </resources>
  <dimensions>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗагрязняющееВещество</name>
    <type>
      <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
      <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
      <types>CatalogRef.ЗВВода</types>
      <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
      <types>CatalogRef.ФакторыФизическогоВоздействия</types>
      <types>CatalogRef.ЗВАтмосфера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Методика</name>
    <type>
      <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Documents/АттестатАккредитации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументовСправочников.ЗаполнитьДокумент(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр лис_ПриложениеКАттестатуАккредитации
	Движения.лис_ПриложениеКАттестатуАккредитации.Записывать = Истина;
	Для Каждого ТекСтрокаПриложение Из Приложение Цикл
		Движение = Движения.лис_ПриложениеКАттестатуАккредитации.Добавить();
		Движение.РазделУчета = ТекСтрокаПриложение.РазделУчета;
		Движение.Лаборатория = Лаборатория;
		Движение.ЗагрязняющееВещество = ТекСтрокаПриложение.ЗагрязняющееВещество;
		Движение.Методика = ТекСтрокаПриложение.Методика;
		Движение.ДиапазонОт = ТекСтрокаПриложение.ДиапазонОт;
		Движение.ДиапазонДо = ТекСтрокаПриложение.ДиапазонДо;
		Движение.ЕдиницаИзмерения = ТекСтрокаПриложение.ЕдиницаИзмерения;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли
